In [1]:
import pandas as pd

# Regex


- * means zero or more
- . means match any character

- \( tell regex to include ( in searching expression

In [5]:
#### "r\(.*\)"
# \( - tell regex to include ( in searching expression

In [12]:
sample={"names":['Abhay','Rajeev','Adithya'],
"Occupation":['Stud1','Stud2','Stud3'],
"City":['Bangalore','Mumbai','Delhi']
}

In [14]:
sample_df=pd.DataFrame(sample)

In [20]:
sample_df

     names Occupation       City
0    Abhay      Stud1  Bangalore
1   Rajeev      Stud2     Mumbai
2  Adithya      Stud3      Delhi

In [19]:
sample_df.replace('A.*','CAT',regex=True)

    names Occupation       City
0     CAT      Stud1  Bangalore
1  Rajeev      Stud2     Mumbai
2     CAT      Stud3      Delhi

In [21]:
sample_df

     names Occupation       City
0    Abhay      Stud1  Bangalore
1   Rajeev      Stud2     Mumbai
2  Adithya      Stud3      Delhi

In [32]:
sample_df.iloc[:2, :2]

    names Occupation
0   Abhay      Stud1
1  Rajeev      Stud2

# Categorical Data 

### What is Categorical Data

- Categorical Data is text or labelled data that represent discrete categories

In [33]:

sample_df

     names Occupation       City
0    Abhay      Stud1  Bangalore
1   Rajeev      Stud2     Mumbai
2  Adithya      Stud3      Delhi

In [36]:
sample_df.info()

<class 'pandas.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   names       3 non-null      str
 1   Occupation  3 non-null      str
 2   City        3 non-null      str
dtypes: str(3)
memory usage: 204.0 bytes

In [43]:
sample_df.apply(lambda Ocuppation: 1 if 'Occupation'=='Stud2' else 0)

names         0
Occupation    0
City          0
dtype: int64

In [47]:
sample_df['DOB']=['2020-01-04','2012-10-09','2001-11-31']

In [48]:
sample_df

     names Occupation       City         DOB
0    Abhay      Stud1  Bangalore  2020-01-04
1   Rajeev      Stud2     Mumbai  2012-10-09
2  Adithya      Stud3      Delhi  2001-11-31

In [50]:
sample_df.info()

<class 'pandas.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   names       3 non-null      str
 1   Occupation  3 non-null      str
 2   City        3 non-null      str
 3   DOB         3 non-null      str
dtypes: str(4)
memory usage: 228.0 bytes

In [ ]:
sample_df['DOB_updated']=pd.to_datetime(sample_df['DOB'])

ValueError: day is out of range for month. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [54]:
import pandas as pd
df = pd.DataFrame({'date': ['2025-06-21', '2025-06-22']})
#df['date'] = pd.to_datetime(df['date'])
#print(df)

In [56]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    2 non-null      str
dtypes: str(1)
memory usage: 148.0 bytes

In [57]:
df['date_ud']=pd.to_datetime(df['date'])

In [62]:
df2=sample_df.copy()

In [78]:
df2.iloc[:,:]

     names Occupation       City         DOB
0    Abhay      Stud1  Bangalore  2020-01-04
1   Rajeev      Stud2     Mumbai  2012-10-09
2  Adithya      Stud3      Delhi  2001-11-31

In [79]:
dd=df2.iloc[:2,:2]

In [80]:
print(dd)

    names Occupation
0   Abhay      Stud1
1  Rajeev      Stud2